In [179]:
import pandas as pd
import numpy as np

Series (It is a one-dimensional array holding data of any type.)

In [180]:
lables = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10, 'b':20,'c':30}

In [181]:
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

In [182]:
pd.Series(data = my_data, index = lables)

a    10
b    20
c    30
dtype: int64

In [183]:
pd.Series(my_data,lables)

a    10
b    20
c    30
dtype: int64

In [184]:
pd.Series(arr,lables)

a    10
b    20
c    30
dtype: int32

In [185]:
ser1 = pd.Series(d)
ser1

a    10
b    20
c    30
dtype: int64

In [186]:
ser1['b']

20

In [187]:
set1 = pd.Series([1,2,3],['India', 'Japan','China'])
set1

India    1
Japan    2
China    3
dtype: int64

In [188]:
set2 = pd.Series([5,4,2],['India', 'USA','China'])
set2

India    5
USA      4
China    2
dtype: int64

In [189]:
set1+set2
#here the similar labels get added and the unique one will be defined with NaN

China    5.0
India    6.0
Japan    NaN
USA      NaN
dtype: float64

DATA FRAMES (DataFrame is a 2-dimensional labeled data structure with columns of potentially different types)

In [190]:
df = pd.DataFrame(np.random.randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
#                   random 5X4 matrix  , Row labels       ,   Column labels
df

          W         X         Y         Z
A  0.081523 -0.415191  0.053661 -2.115113
B -0.279510  1.062710  1.752014  0.695547
C  0.153661  0.167638 -0.765930  0.962299
D  0.902826 -0.537909 -1.549671  0.435253
E  1.259904 -0.447898  0.266207  0.412580

In [192]:
df['W']
#df.W also works but might not be a good practice

A    0.081523
B   -0.279510
C    0.153661
D    0.902826
E    1.259904
Name: W, dtype: float64

In [ ]:
df[['W','Z']]
# use double square brackets when you want two or more column

          W         Z
A -0.380104  1.522562
B  0.178009  1.743477
C  1.130018 -1.063049
D -0.125381 -1.046358
E -1.306482 -1.667537

In [ ]:
df['new'] = df['W'] + df['Y']
df
#To create a new column

          W         X         Y         Z       new
A -0.380104 -1.666059 -2.736995  1.522562 -3.117098
B  0.178009 -0.626805 -0.391089  1.743477 -0.213080
C  1.130018  0.897796  0.330866 -1.063049  1.460884
D -0.125381 -0.945588  2.029544 -1.046358  1.904163
E -1.306482 -1.632924  0.802129 -1.667537 -0.504353

In [ ]:
df.drop('new', axis=1)

          W         X         Y         Z
A -0.380104 -1.666059 -2.736995  1.522562
B  0.178009 -0.626805 -0.391089  1.743477
C  1.130018  0.897796  0.330866 -1.063049
D -0.125381 -0.945588  2.029544 -1.046358
E -1.306482 -1.632924  0.802129 -1.667537

In [ ]:
df
#We could remove the row only in the previous cell but not completelty

          W         X         Y         Z       new
A -0.380104 -1.666059 -2.736995  1.522562 -3.117098
B  0.178009 -0.626805 -0.391089  1.743477 -0.213080
C  1.130018  0.897796  0.330866 -1.063049  1.460884
D -0.125381 -0.945588  2.029544 -1.046358  1.904163
E -1.306482 -1.632924  0.802129 -1.667537 -0.504353

In [ ]:
df.drop('new', axis=1, inplace=True)
#hence we use inplace= true method in order to permanently drop the data that we want

In [ ]:
df

          W         X         Y         Z
A -0.380104 -1.666059 -2.736995  1.522562
B  0.178009 -0.626805 -0.391089  1.743477
C  1.130018  0.897796  0.330866 -1.063049
D -0.125381 -0.945588  2.029544 -1.046358
E -1.306482 -1.632924  0.802129 -1.667537

In [ ]:
df.drop('E',axis=0)

          W         X         Y         Z
A -0.380104 -1.666059 -2.736995  1.522562
B  0.178009 -0.626805 -0.391089  1.743477
C  1.130018  0.897796  0.330866 -1.063049
D -0.125381 -0.945588  2.029544 -1.046358

In [ ]:
df.shape

(5, 4)

Remember that we use loc or iloc specially to extract row information

In [193]:
#extract rows
#loc = location

df.loc['A']

W    0.081523
X   -0.415191
Y    0.053661
Z   -2.115113
Name: A, dtype: float64

In [ ]:
# extract row way-2
#iloc = index location
df.iloc[0]

W   -0.380104
X   -1.666059
Y   -2.736995
Z    1.522562
Name: A, dtype: float64

In [ ]:
#to extract one value
df.loc['D','Z']
#row , column

-1.0463583859222323

In [ ]:
df.loc[['A','B'],['W','Y']]

          W         Y
A -0.380104 -2.736995
B  0.178009 -0.391089

In [ ]:
booldf = df > 0
booldf

       W      X      Y      Z
A  False  False  False   True
B   True  False  False   True
C   True   True   True  False
D  False  False   True  False
E  False  False   True  False

In [ ]:
df[booldf]
# or u can say df[df>0]

          W         X         Y         Z
A       NaN       NaN       NaN  1.522562
B  0.178009       NaN       NaN  1.743477
C  1.130018  0.897796  0.330866       NaN
D       NaN       NaN  2.029544       NaN
E       NaN       NaN  0.802129       NaN

In [ ]:
df['W']>0

A    False
B     True
C     True
D    False
E    False
Name: W, dtype: bool

In [ ]:
df['W']

A   -0.380104
B    0.178009
C    1.130018
D   -0.125381
E   -1.306482
Name: W, dtype: float64

In [ ]:
df[df['W']>0]
# we only get rows that satisfies the condition

          W         X         Y         Z
B  0.178009 -0.626805 -0.391089  1.743477
C  1.130018  0.897796  0.330866 -1.063049

In [ ]:
#multiple conditions
df[(df['W']>0) & (df['Y']>1)]
#my random numbers doesn't ave any output for such condition, might work for u

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

In [ ]:
df[(df['W']>0) | (df['Y']>1)]

          W         X         Y         Z
B  0.178009 -0.626805 -0.391089  1.743477
C  1.130018  0.897796  0.330866 -1.063049
D -0.125381 -0.945588  2.029544 -1.046358

In [ ]:
#reset index to default
df.reset_index()
# you can use inplace = True function to maker it peramanent
# our index turns into a column

  index         W         X         Y         Z
0     A -0.380104 -1.666059 -2.736995  1.522562
1     B  0.178009 -0.626805 -0.391089  1.743477
2     C  1.130018  0.897796  0.330866 -1.063049
3     D -0.125381 -0.945588  2.029544 -1.046358
4     E -1.306482 -1.632924  0.802129 -1.667537

In [ ]:
newindex = 'CA NY WY OR CO'.split()
newindex
#quick may to make index

['CA', 'NY', 'WY', 'OR', 'CO']

In [ ]:
df['States'] = newindex

In [ ]:
df

          W         X         Y         Z States
A -0.380104 -1.666059 -2.736995  1.522562     CA
B  0.178009 -0.626805 -0.391089  1.743477     NY
C  1.130018  0.897796  0.330866 -1.063049     WY
D -0.125381 -0.945588  2.029544 -1.046358     OR
E -1.306482 -1.632924  0.802129 -1.667537     CO

In [ ]:
df.set_index('States',inplace = True)
# Altering index according to our requirement

In [ ]:
df

               W         X         Y         Z
States
CA     -0.380104 -1.666059 -2.736995  1.522562
NY      0.178009 -0.626805 -0.391089  1.743477
WY      1.130018  0.897796  0.330866 -1.063049
OR     -0.125381 -0.945588  2.029544 -1.046358
CO     -1.306482 -1.632924  0.802129 -1.667537

MULTI INDEXING

In [ ]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [ ]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [ ]:
df = pd.DataFrame(np.random.randn(6,2), hier_index,['A','B'])
df

             A         B
G1 1  0.608857  0.286473
   2 -0.205792  2.493990
   3 -0.547260  0.496727
G2 1 -1.235614 -0.798428
   2  0.754121 -0.772041
   3 -0.034432  0.688408

In [ ]:
df.loc['G1':'A']

Empty DataFrame
Columns: [A, B]
Index: []

In [ ]:
df.loc['G1'].loc[1:2]

          A         B
1  0.608857  0.286473
2 -0.205792  2.493990

In [ ]:
#naming
df.index.names = ['Groups','Num']
df

                   A         B
Groups Num
G1     1    0.608857  0.286473
       2   -0.205792  2.493990
       3   -0.547260  0.496727
G2     1   -1.235614 -0.798428
       2    0.754121 -0.772041
       3   -0.034432  0.688408

In [ ]:
df.loc['G2'].loc[2]['B']

-0.7720406439702567

In [ ]:
df.xs(1, level='Num') #cross section to extract only value 1

               A         B
Groups
G1      0.608857  0.286473
G2     -1.235614 -0.798428

Done with Mid level pandas